%求解Ci
% Ci = [C1; C2; C3; C4]
% mi 各个连杆质量  Rii 连杆i质心在关节i坐标系中的表示
%重力矩阵是各个关节位置q的函数
function Ci = C_matrix(q)

%机器人D-H参数
theta1 = q(1); theta2 = q(2); theta3 = q(3); theta4 = 0;

%转换单位（m）
d1 = 0.0; a2 = 1.300; d4 = 1.400 + 0.32545;%(增加了手腕的长度）
%首先建立前四关节的运动学
T01 = Chuandi_matrix(pi/2,  0 ,   d1, theta1     );
T12 = Chuandi_matrix(0   ,  a2,   0 , theta2+pi/2);
T23 = Chuandi_matrix(pi/2,  0 ,   0 , theta3     );
T34 = Chuandi_matrix(0   ,  0 ,   d4, theta4     );

T02 = T01*T12;
T03 = T02*T23;
T04 = T03*T34;

T13 = T12*T23;
T14 = T13*T34;

T24 = T23*T34;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%数据预准备2
%伪惯量矩阵的计算

%基座相对于其转动轴axis_2的惯性张量（千克*平方米）
%质量(千克）、重心（米）（相对于转动轴axis_2)
mi_1 = 182.10327824;
X1 =  0.00611769;
Y1 =  -0.04846321;
Z1 =  -0.03074003;
                                                
%大臂相对于其转动轴axis_3的惯性张量（千克*平方米）
%质量(千克）、重心（米）（相对于转动轴axis_3)
mi_2 = 78.58091036;
X2 = -0.60328009;
Y2 = -0.00002796;
Z2 = -0.33729352;
                                                 
%小臂相对于其转动轴axis_8的惯性张量（千克*平方米）
%质量(千克）、重心（米）（相对于转动轴axis_4)
mi_3 = 82.07360471 ;
X3 = -0.00159643;
Y3 = -0.06444111;
Z3 =  0.64843688;
                                                
%手腕部分（暂时没考虑）固定到小臂上了。。。
mi_4 = 0;
X4 = 0;
Y4 = 0;
Z4 = 0;


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%数据预准备3
% （1） 关于Uij和Uijk的求解
Q1 = [0 -1 0 0;
      1  0 0 0;
      0  0 0 0;
      0  0 0 0];
Q2 = [0 -1 0 0;
      1  0 0 0;
      0  0 0 0;
      0  0 0 0];
Q3 = [0 -1 0 0;
      1  0 0 0;
      0  0 0 0;
      0  0 0 0];
Q4 = [0 -1 0 0;
      1  0 0 0;
      0  0 0 0;
      0  0 0 0];
  
  


U11 = Q1*T01;

U21 = Q1*T02;
U22 = T01*Q2*T12;

U31 = Q1*T03;
U32 = T01*Q2*T13;
U33 = T02*Q3*T23;

U41 = Q1*T04;
U42 = T01*Q2*T14;
U43 = T02*Q3*T24;
U44 = T03*Q4*T34;




g = [0  0 -9.8];%在基坐标系下的重力矢量
%因为对基坐标系进行了15度的变化，所以所有计算的数值是相当于转换后的坐标而言的，在此需要对重力矢量进行同样的操作
g_temp = ROT_y(g', -pi/12);
g = [g_temp' 0];


R11 = [X1; Y1; Z1; 1];
R22 = [X2; Y2; Z2; 1];
R33 = [X3; Y3; Z3; 1];
R44 = [X4; Y4; Z4; 1];
C1 = - mi_1*g*U11*R11 - mi_2*g*U21*R22 - mi_3*g*U31*R33 - mi_4*g*U41*R44;
C2 =                  - mi_2*g*U22*R22 - mi_3*g*U32*R33 - mi_4*g*U42*R44;
C3 =                                   - mi_3*g*U33*R33 - mi_4*g*U43*R44;
C4 =                                                    - mi_4*g*U44*R44;


temp_JOINT_1_yaobu_torque  =  - mi_1*g*U11*R11; %腰部的重力在关节1处产生的转矩
temp_JOINT_1_dabi_torque   =  - mi_2*g*U21*R22; %大臂的重力在关节1处产生的转矩
temp_JOINT_1_xiaobi_torque =  - mi_3*g*U31*R33; %小臂的重力在关节1处产生的转矩
Ci = [C1; C2; C3; C4; temp_JOINT_1_yaobu_torque; temp_JOINT_1_dabi_torque; temp_JOINT_1_xiaobi_torque];